In [ ]:
import pandas as pd
students = {
    "name":["manish","aman","kachan","ritik"],
    "age":[8,12,23,12],
    "class":[1,2,3,4]
}
df = pd.DataFrame(students,index=[2,3,4,5])
df

     name  age  class
2  manish    8      1
3    aman   12      2
4  kachan   23      3
5   ritik   12      4

In [15]:
df["marks"]=[34,56,76,77]

In [16]:
df

     name  age  class  marks
2  manish    8      1     34
3    aman   12      2     56
4  kachan   23      3     76
5   ritik   12      4     77

In [17]:
df["subject"]=["maths","english","science","gk"]

In [18]:
df

     name  age  class  marks  subject
2  manish    8      1     34    maths
3    aman   12      2     56  english
4  kachan   23      3     76  science
5   ritik   12      4     77       gk

In [19]:
#filtered

In [20]:
filtered_Data=df[(df["marks"] >60 )| (df["subject"]=="science")]
filtered_Data

     name  age  class  marks  subject
4  kachan   23      3     76  science
5   ritik   12      4     77       gk

In [21]:
df_sort=df.sort_values(by="marks")
df

     name  age  class  marks  subject
2  manish    8      1     34    maths
3    aman   12      2     56  english
4  kachan   23      3     76  science
5   ritik   12      4     77       gk